"auto";

setScreenMetrics(1080, 1920);

//  FS <==> FGO SERVENT
var FS = require('fgo_cmd.js'); 

// print('!- SCRIPT START');

yanzuo_xiaomo();  // 赝作复刻 - 术本 - 心脏 - 小莫 3T 冲浪
// tst_skill();

// print('!- SCRIPT END');

// console.show();

// ----------------------------------------------------------------- //
// ----------------------------------------------------------------- //
// ----------------------------------------------------------------- //

// 技能测试函数
function tst_skill(){
    // var FS;
    // FS.C1(3,2);
    // FS.SWITCH_SERVENT(3, 4); // 孔老师 下班 小玉 加班

}

// ----------------------------------------------------------------- //
// 活动：周回副本（阵容仅供参考）
// 队伍：3T 过
// 阵容：肯娘 - 清姬 - 大英雄 | 梅林 - '助战' - 式姐
// 礼装：万华镜 - 万华镜 - 满破虚数 | X - '助战' - 午餐
// ----------------------------------------------------------------- //
function get_exp(){
	FS.C3();

	FS.ATK();
	
	FS.EC();
	FS.P4();
	FS.P5();

	sleep(25000); // 看烟花... 25s

	FS.C1();
	FS.B3(); // 可以注释
	
	FS.ATK();

	FS.EB();
	FS.P3();
	FS.P4();

	sleep(35000); // 看烧烤... 35s
	
	FS.A3();

	FS.ATK();

	FS.EB();
	FS.P3();
	FS.P4();

	sleep(35000); // 看打雷... 30s

	FS.ATK();  // 点击画面，使用 ATK 模拟掉
    FS.ATK();
	FS.NEXT(); // 点击下一步，完成刷本

}



// ----------------------------------------------------------------- //
// 功能：无限池自动抽奖
// ----------------------------------------------------------------- //
function infi_awards(){

	var count = 200;

	for (i = 0; i < count; i++)
		FS.INFI0();


	
	
}


// ----------------------------------------------------------------- //
// 活动：赝作复刻
// 队伍：小莫 3T 冲浪
// 阵容：牛肉丸 - 小莫 - 孔老师 | 小玉 - '助战' - 学妹
// 礼装：万华镜 - 满破学者 - 学者 | 学者 - 助战 - 学者
// ----------------------------------------------------------------- //
function yanzuo_xiaomo(){
	
    sleep(1000);      // 1s  缓启动
    FS.START(40000);  // 40s 加载... 跑芙芙

	// --- ROUND 1 --- //
	FS.C1(3, 2);  // 孔老师 加班
	FS.C2();      // 50NP 加满
	FS.C3();

	FS.SWITCH_SERVENT(3, 4); // 孔老师 下班 小玉 加班

	FS.C3(3, 2);  // 小玉

	FS.B1();      // 小莫

	FS.A1();      // 牛肉丸
	FS.A2();

	FS.ATK();     // 攻击

	FS.EB();      // 选卡
	FS.EA();
	FS.P2();

	sleep(35000); // 冲浪中... 35s

	// --- ROUND 2 --- //

	FS.ATK();     // 攻击

	FS.EB();      // 选卡
	FS.EA();
	FS.P2();

	sleep(35000); // 冲浪中... 35s

	// --- ROUND 3 --- //

	FS.B3();   // 小莫， NP满上

	FS.MS0();  // 礼装攻击力
	FS.MS1();

	FS.ATK();

	FS.EB();
	FS.EA();
	FS.P2();

    sleep(45000);  // 冲浪中...跳船中... 45s
    
    FS.ATK();  // 点击画面，使用 ATK 模拟掉
    FS.ATK();
	FS.NEXT(); // 点击下一步，完成刷本
	
}

